coocox/Mplib/Toshaba/TMPM36x/TMPM366/cmsis_lib/lib/include/tmpm366_gpio.h
#define GPIO_PE_OUTPUT_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PE_PULLUP_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PE_OPEN_DRAIN_BIT_ALL               ((uint8_t)0xFF)
#define GPIO_PE_INPUT_BIT_ALL                    ((uint8_t)0xFF)
#define GPIO_PE_FR1_BIT_ALL                      ((uint8_t)0xFF)
#define GPIO_PE_FR2_BIT_ALL                      ((uint8_t)0xF8)
#define GPIO_PE_FR3_BIT_ALL                      ((uint8_t)0x0C)
#define GPIO_PE_FR4_BIT_ALL                      ((uint8_t)0x04)
#define GPIO_PE_FR5_BIT_ALL                      ((uint8_t)0x0F)

#define GPIO_PF_OUTPUT_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PF_PULLUP_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PF_OPEN_DRAIN_BIT_ALL               ((uint8_t)0xFF)
#define GPIO_PF_INPUT_BIT_ALL                    ((uint8_t)0xFE)
#define GPIO_PF_FR1_BIT_ALL                      ((uint8_t)0xFF)
#define GPIO_PF_FR2_BIT_ALL                      ((uint8_t)0x30)
#define GPIO_PF_FR3_BIT_ALL                      ((uint8_t)0x31)

#define GPIO_PG_OUTPUT_BIT_ALL                   ((uint8_t)0x3F)
#define GPIO_PG_PULLUP_BIT_ALL                   ((uint8_t)0x3F)
#define GPIO_PG_OPEN_DRAIN_BIT_ALL               ((uint8_t)0x3F)
#define GPIO_PG_INPUT_BIT_ALL                    ((uint8_t)0x3F)
#define GPIO_PG_FR1_BIT_ALL                      ((uint8_t)0x2F)
#define GPIO_PG_FR2_BIT_ALL                      ((uint8_t)0x1F)
#define GPIO_PG_FR3_BIT_ALL                      ((uint8_t)0x1E)
#define GPIO_PG_FR4_BIT_ALL                      ((uint8_t)0x3F)
#define GPIO_PG_FR5_BIT_ALL                      ((uint8_t)0x03)

#define GPIO_PH_OUTPUT_BIT_ALL                   ((uint8_t)0x1F)
#define GPIO_PH_PULLUP_BIT_ALL                   ((uint8_t)0x1F)
#define GPIO_PH_OPEN_DRAIN_BIT_ALL               ((uint8_t)0x1F)
#define GPIO_PH_INPUT_BIT_ALL                    ((uint8_t)0x1F)
#define GPIO_PH_FR1_BIT_ALL                      ((uint8_t)0x03)
#define GPIO_PH_FR2_BIT_ALL                      ((uint8_t)0x1C)
#define GPIO_PH_FR3_BIT_ALL                      ((uint8_t)0x1C)
#define GPIO_PH_FR4_BIT_ALL                      ((uint8_t)0x1C)

#define GPIO_PI_OUTPUT_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PI_PULLUP_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PI_PULLDOWN_BIT_ALL                 ((uint8_t)0x08)
#define GPIO_PI_OPEN_DRAIN_BIT_ALL               ((uint8_t)0x07)
#define GPIO_PI_INPUT_BIT_ALL                    ((uint8_t)0xFF)
#define GPIO_PI_FR1_BIT_ALL                      ((uint8_t)0xFF)

#define GPIO_PJ_OUTPUT_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PJ_PULLUP_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PJ_INPUT_BIT_ALL                    ((uint8_t)0xFF)
#define GPIO_PJ_FR2_BIT_ALL                      ((uint8_t)0x80)
#define GPIO_PJ_FR3_BIT_ALL                      ((uint8_t)0xC0)

#define GPIO_PK_OUTPUT_BIT_ALL                   ((uint8_t)0x0F)
#define GPIO_PK_PULLUP_BIT_ALL                   ((uint8_t)0x0F)
#define GPIO_PK_INPUT_BIT_ALL                    ((uint8_t)0x0F)
#define GPIO_PK_FR2_BIT_ALL                      ((uint8_t)0x03)
#define GPIO_PK_FR3_BIT_ALL                      ((uint8_t)0x0F)

#define IS_GPIO_PA_DATA_BIT(param)      (((param) == GPIO_BIT_0)|| \
                                         ((param) == GPIO_BIT_1)|| \
                                         ((param) == GPIO_BIT_2)|| \
                                         ((param) == GPIO_BIT_3)|| \
                                         ((param) == GPIO_BIT_4)|| \
                                         ((param) == GPIO_BIT_5)|| \
                                         ((param) == GPIO_BIT_6)|| \
                                         ((param) == GPIO_BIT_7))

#define IS_GPIO_PB_DATA_BIT(param)      (((param) == GPIO_BIT_0)|| \
                                         ((param) == GPIO_BIT_1)|| \
                                         ((param) == GPIO_BIT_2)|| \
                                         ((param) == GPIO_BIT_3)|| \
                                         ((param) == GPIO_BIT_4)|| \
                                         ((param) == GPIO_BIT_5)|| \
                                         ((param) == GPIO_BIT_6)|| \
                                         ((param) == GPIO_BIT_7))

#define IS_GPIO_PC_DATA_BIT(param)      (((param) == GPIO_BIT_0)|| \
                                         ((param) == GPIO_BIT_1)|| \
                                         ((param) == GPIO_BIT_2))

#define IS_GPIO_PD_DATA_BIT(param)      (((param) == GPIO_BIT_0)|| \
                                         ((param) == GPIO_BIT_1)|| \
                                         ((param) == GPIO_BIT_2)|| \
                                         ((param) == GPIO_BIT_3)|| \
                                         ((param) == GPIO_BIT_4)|| \
                                         ((param) == GPIO_BIT_5)|| \
                                         ((param) == GPIO_BIT_6)|| \
                                         ((param) == GPIO_BIT_7))

#define IS_GPIO_PE_DATA_BIT(param)      (((param) == GPIO_BIT_0)|| \
                                         ((param) == GPIO_BIT_1)|| \
                                         ((param) == GPIO_BIT_2)|| \
                                         ((param) == GPIO_BIT_3)|| \
                                         ((param) == GPIO_BIT_4)|| \
                                         ((param) == GPIO_BIT_5)|| \
                                         ((param) == GPIO_BIT_6)|| \
                                         ((param) == GPIO_BIT_7))

#define IS_GPIO_PF_DATA_BIT(param)      (((param) == GPIO_BIT_0)|| \
                                         ((param) == GPIO_BIT_1)|| \
                                         ((param) == GPIO_BIT_2)|| \
                                         ((param) == GPIO_BIT_3)|| \
                                         ((param) == GPIO_BIT_4)|| \
                                         ((param) == GPIO_BIT_5)|| \
                                         ((param) == GPIO_BIT_6)|| \
                                         ((param) == GPIO_BIT_7))

