coocox/Mplib/Toshaba/TMPM36x/TMPM366/cmsis_lib/lib/include/tmpm366_gpio.h
#define IS_GPIO_PG_DATA_BIT(param)      (((param) == GPIO_BIT_0)|| \
                                         ((param) == GPIO_BIT_1)|| \
                                         ((param) == GPIO_BIT_2)|| \
                                         ((param) == GPIO_BIT_3)|| \
                                         ((param) == GPIO_BIT_4)|| \
                                         ((param) == GPIO_BIT_5))

#define IS_GPIO_PH_DATA_BIT(param)      (((param) == GPIO_BIT_0)|| \
                                         ((param) == GPIO_BIT_1)|| \
                                         ((param) == GPIO_BIT_2)|| \
                                         ((param) == GPIO_BIT_3)|| \
                                         ((param) == GPIO_BIT_4))

#define IS_GPIO_PI_DATA_BIT(param)      (((param) == GPIO_BIT_0)|| \
                                         ((param) == GPIO_BIT_1)|| \
                                         ((param) == GPIO_BIT_2)|| \
                                         ((param) == GPIO_BIT_3)|| \
                                         ((param) == GPIO_BIT_4)|| \
                                         ((param) == GPIO_BIT_5)|| \
                                         ((param) == GPIO_BIT_6)|| \
                                         ((param) == GPIO_BIT_7))

#define IS_GPIO_PJ_DATA_BIT(param)      (((param) == GPIO_BIT_0)|| \
                                         ((param) == GPIO_BIT_1)|| \
                                         ((param) == GPIO_BIT_2)|| \
                                         ((param) == GPIO_BIT_3)|| \
                                         ((param) == GPIO_BIT_4)|| \
                                         ((param) == GPIO_BIT_5)|| \
                                         ((param) == GPIO_BIT_6)|| \
                                         ((param) == GPIO_BIT_7))

#define IS_GPIO_PK_DATA_BIT(param)      (((param) == GPIO_BIT_0)|| \
                                         ((param) == GPIO_BIT_1)|| \
                                         ((param) == GPIO_BIT_2)|| \
                                         ((param) == GPIO_BIT_3))


#define IS_GPIO_PA_OUTPUT_BIT(param)     (((param) & GPIO_PA_OUTPUT_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PA_OUTPUT_BIT_ALL))))

#define IS_GPIO_PA_FR1_BIT(param)        (((param) & GPIO_PA_FR1_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PA_FR1_BIT_ALL))))

#define IS_GPIO_PA_OPEN_DRAIN_BIT(param) (((param) & GPIO_PA_OPEN_DRAIN_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PA_OPEN_DRAIN_BIT_ALL))))

#define IS_GPIO_PA_PULLUP_BIT(param)     (((param) & GPIO_PA_PULLUP_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PA_PULLUP_BIT_ALL))))

#define IS_GPIO_PA_INPUT_BIT(param)      (((param) & GPIO_PA_INPUT_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PA_INPUT_BIT_ALL))))

#define IS_GPIO_PB_OUTPUT_BIT(param)     (((param) & GPIO_PB_OUTPUT_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PB_OUTPUT_BIT_ALL))))

#define IS_GPIO_PB_FR1_BIT(param)        (((param) & GPIO_PB_FR1_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PB_FR1_BIT_ALL))))

#define IS_GPIO_PB_FR2_BIT(param)        (((param) & GPIO_PB_FR2_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PB_FR2_BIT_ALL))))

#define IS_GPIO_PB_FR3_BIT(param)        (((param) & GPIO_PB_FR3_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PB_FR3_BIT_ALL))))

#define IS_GPIO_PB_OPEN_DRAIN_BIT(param) (((param) & GPIO_PB_OPEN_DRAIN_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PB_OPEN_DRAIN_BIT_ALL))))

#define IS_GPIO_PB_PULLUP_BIT(param)     (((param) & GPIO_PB_PULLUP_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PB_PULLUP_BIT_ALL))))

#define IS_GPIO_PB_INPUT_BIT(param)      (((param) & GPIO_PB_INPUT_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PB_INPUT_BIT_ALL))))

#define IS_GPIO_PC_OUTPUT_BIT(param)     (((param) & GPIO_PC_OUTPUT_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PC_OUTPUT_BIT_ALL))))

#define IS_GPIO_PC_FR1_BIT(param)        (((param) & GPIO_PC_FR1_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PC_FR1_BIT_ALL))))

#define IS_GPIO_PC_FR2_BIT(param)        (((param) & GPIO_PC_FR2_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PC_FR2_BIT_ALL))))

#define IS_GPIO_PC_FR3_BIT(param)        (((param) & GPIO_PC_FR3_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PC_FR3_BIT_ALL))))

#define IS_GPIO_PC_FR4_BIT(param)        (((param) & GPIO_PC_FR4_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PC_FR4_BIT_ALL))))

#define IS_GPIO_PC_OPEN_DRAIN_BIT(param) (((param) & GPIO_PC_OPEN_DRAIN_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PC_OPEN_DRAIN_BIT_ALL))))

#define IS_GPIO_PC_PULLUP_BIT(param)     (((param) & GPIO_PC_PULLUP_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PC_PULLUP_BIT_ALL))))

#define IS_GPIO_PC_INPUT_BIT(param)      (((param) & GPIO_PC_INPUT_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PC_INPUT_BIT_ALL))))

#define IS_GPIO_PD_OUTPUT_BIT(param)     (((param) & GPIO_PD_OUTPUT_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PD_OUTPUT_BIT_ALL))))

#define IS_GPIO_PD_FR2_BIT(param)        (((param) & GPIO_PD_FR2_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PD_FR2_BIT_ALL))))

#define IS_GPIO_PD_FR3_BIT(param)        (((param) & GPIO_PD_FR3_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PD_FR3_BIT_ALL))))

#define IS_GPIO_PD_OPEN_DRAIN_BIT(param) (((param) & GPIO_PD_OPEN_DRAIN_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PD_OPEN_DRAIN_BIT_ALL))))

#define IS_GPIO_PD_PULLUP_BIT(param)     (((param) & GPIO_PD_PULLUP_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PD_PULLUP_BIT_ALL))))

#define IS_GPIO_PD_INPUT_BIT(param)      (((param) & GPIO_PD_INPUT_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PD_INPUT_BIT_ALL))))

#define IS_GPIO_PE_OUTPUT_BIT(param)     (((param) & GPIO_PE_OUTPUT_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PE_OUTPUT_BIT_ALL))))

