coocox/Mplib/Toshaba/TMPM36x/TMPM366/cmsis_lib/lib/include/tmpm366_gpio.h
#define IS_GPIO_PE_FR1_BIT(param)        (((param) & GPIO_PE_FR1_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PE_FR1_BIT_ALL))))

#define IS_GPIO_PE_FR2_BIT(param)        (((param) & GPIO_PE_FR2_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PE_FR2_BIT_ALL))))

#define IS_GPIO_PE_FR3_BIT(param)        (((param) & GPIO_PE_FR3_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PE_FR3_BIT_ALL))))

#define IS_GPIO_PE_FR4_BIT(param)        (((param) & GPIO_PE_FR4_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PE_FR4_BIT_ALL))))

#define IS_GPIO_PE_FR5_BIT(param)        (((param) & GPIO_PE_FR5_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PE_FR5_BIT_ALL))))

#define IS_GPIO_PE_OPEN_DRAIN_BIT(param) (((param) & GPIO_PE_OPEN_DRAIN_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PE_OPEN_DRAIN_BIT_ALL))))

#define IS_GPIO_PE_PULLUP_BIT(param)     (((param) & GPIO_PE_PULLUP_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PE_PULLUP_BIT_ALL))))

#define IS_GPIO_PE_INPUT_BIT(param)      (((param) & GPIO_PE_INPUT_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PE_INPUT_BIT_ALL))))

#define IS_GPIO_PF_OUTPUT_BIT(param)     (((param) & GPIO_PF_OUTPUT_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PF_OUTPUT_BIT_ALL))))

#define IS_GPIO_PF_FR1_BIT(param)        (((param) & GPIO_PF_FR1_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PF_FR1_BIT_ALL))))

#define IS_GPIO_PF_FR2_BIT(param)        (((param) & GPIO_PF_FR2_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PF_FR2_BIT_ALL))))

#define IS_GPIO_PF_FR3_BIT(param)        (((param) & GPIO_PF_FR3_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PF_FR3_BIT_ALL))))

#define IS_GPIO_PF_OPEN_DRAIN_BIT(param) (((param) & GPIO_PF_OPEN_DRAIN_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PF_OPEN_DRAIN_BIT_ALL))))

#define IS_GPIO_PF_PULLUP_BIT(param)     (((param) & GPIO_PF_PULLUP_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PF_PULLUP_BIT_ALL))))

#define IS_GPIO_PF_INPUT_BIT(param)      (((param) & GPIO_PF_INPUT_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PF_INPUT_BIT_ALL))))

#define IS_GPIO_PG_OUTPUT_BIT(param)     (((param) & GPIO_PG_OUTPUT_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PG_OUTPUT_BIT_ALL))))

#define IS_GPIO_PG_FR1_BIT(param)        (((param) & GPIO_PG_FR1_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PG_FR1_BIT_ALL))))

#define IS_GPIO_PG_FR2_BIT(param)        (((param) & GPIO_PG_FR2_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PG_FR2_BIT_ALL))))

#define IS_GPIO_PG_FR3_BIT(param)        (((param) & GPIO_PG_FR3_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PG_FR3_BIT_ALL))))

#define IS_GPIO_PG_FR4_BIT(param)        (((param) & GPIO_PG_FR4_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PG_FR4_BIT_ALL))))

#define IS_GPIO_PG_FR5_BIT(param)        (((param) & GPIO_PG_FR5_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PG_FR5_BIT_ALL))))

#define IS_GPIO_PG_OPEN_DRAIN_BIT(param) (((param) & GPIO_PG_OPEN_DRAIN_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PG_OPEN_DRAIN_BIT_ALL))))

#define IS_GPIO_PG_PULLUP_BIT(param)     (((param) & GPIO_PG_PULLUP_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PG_PULLUP_BIT_ALL))))

#define IS_GPIO_PG_INPUT_BIT(param)      (((param) & GPIO_PG_INPUT_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PG_INPUT_BIT_ALL))))

#define IS_GPIO_PH_OUTPUT_BIT(param)     (((param) & GPIO_PH_OUTPUT_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PH_OUTPUT_BIT_ALL))))

#define IS_GPIO_PH_FR1_BIT(param)        (((param) & GPIO_PH_FR1_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PH_FR1_BIT_ALL))))

#define IS_GPIO_PH_FR2_BIT(param)        (((param) & GPIO_PH_FR2_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PH_FR2_BIT_ALL))))

#define IS_GPIO_PH_FR3_BIT(param)        (((param) & GPIO_PH_FR3_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PH_FR3_BIT_ALL))))

#define IS_GPIO_PH_FR4_BIT(param)        (((param) & GPIO_PH_FR4_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PH_FR4_BIT_ALL))))

#define IS_GPIO_PH_OPEN_DRAIN_BIT(param) (((param) & GPIO_PH_OPEN_DRAIN_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PH_OPEN_DRAIN_BIT_ALL))))

#define IS_GPIO_PH_PULLUP_BIT(param)     (((param) & GPIO_PH_PULLUP_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PH_PULLUP_BIT_ALL))))

#define IS_GPIO_PH_INPUT_BIT(param)      (((param) & GPIO_PH_INPUT_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PH_INPUT_BIT_ALL))))

#define IS_GPIO_PI_OUTPUT_BIT(param)     (((param) & GPIO_PI_OUTPUT_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PI_OUTPUT_BIT_ALL))))

#define IS_GPIO_PI_FR1_BIT(param)        (((param) & GPIO_PI_FR1_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PI_FR1_BIT_ALL))))

#define IS_GPIO_PI_OPEN_DRAIN_BIT(param) (((param) & GPIO_PI_OPEN_DRAIN_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PI_OPEN_DRAIN_BIT_ALL))))

#define IS_GPIO_PI_PULLUP_BIT(param)     (((param) & GPIO_PI_PULLUP_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PI_PULLUP_BIT_ALL))))

